using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class uaRules : MonoBehaviour
{
    private string[] ukrText = {
        "    1.  У якості ігрового поля буде використана обмежена ділянка 9х9 комірок (81 доступна позиція).",
        "",
        "    2.	Перший гравець починає з однією стартовою точкою, що знаходиться у центрі його власної першої лінії нападу. Другий гравець починає з двома точками задля компенсації втрати ініціативності його ходів.",
        "",
        "    3.	Коштовна важливість ліній для кожного гравця визначається її віддаленістю від стартової лінії конкретного гравця. Так як поле 9х9, тому і ліній підрахунку фінальних балів також дев’ять.",
        "    Наприклад лінія, з якої стартує перший гравець принесе йому по 1 балу за кожну захоплену позицію, але ця ж сама лінія принесе по 9 балів за кожну захоплену позицію другому гравцю, так як вона віддалена від його стартової на 7 ліній (перша лінія стартова, дев’ята лінія остання та сім між ними).",
        "",
        "    4.	Захоплювати позицію можна лише в тому разі, якщо вона ще не захоплена другим гравцем та є прилеглою до вже захопленої вами.",
        "    5.	Якщо якісь незахоплені позиції повністю ізольовані одним гравцем від іншого, тобто він ніяк не зможе їх захопити, то вони автоматично захоплюються не витрачаючи хід гравцем, що ізолював їх.",
        "    6.	Перемога віддається тому гравцю, який набрав більше балів після розподілу усіх 81 позицій або у випадку рівної кількості балів перемога віддається другому гравцю.",
        "    7. У режимі \"Тактика\" на початку гри випадково генеруються перешкоди, що перекривають шлях та не дають захоплювати комірки. Перешкоди є дзеркальними, а тому збалансованими.",
        "    8. Також в цьому режимі віртуальний супротивник буде ігнорувати будь-які перешкоди. Це збільшує складність гри та потребує від вас оптимальних стратегічних рішень.",
        "    9. Перемога віддається так само як і у стандартному режимі, але гра може завершитись достроково, якщо на полі залишаться позиції, що неможливо захопити через перешкоди."
    };

    private string[] ukrTittles = {
        "Бойові точки",
        "Одиночна\nгра",
        "Гра\nна двох",
        "Налаштування\nгри",
        "Вийти\nз гри",
        "Правила гри",
        "Перемога!",
        "Просто",
        "Легко",
        "Середнє",
        "Важко",
        "Неможливо",
        "Стандарт",
        "Тактика",
        "Оберіть режим гри",
        "Оберіть кількість перешкод"
    };

    public string[] UkrText { get => ukrText; set => ukrText = value; }
    public string[] UkrTittles { get => ukrTittles; set => ukrTittles = value; }  
}